#!/bin/bash

#Сценарій генерує випадкове число від 1 до 100 і зберігає його в змінній.Користувачеві пропонується вгадати число. Якщо припущення користувача правильне, сценарій має надрукувати «Вітаємо! Ви вгадали правильне число». і вихід. Якщо припущення користувача неправильне, сценарій має надати зворотний зв’язок, як-от «Занадто високо» або «Занадто низько», і дозволити користувачеві вгадати ще раз. Користувач повинен мати максимум 5 спроб, щоб вгадати правильне число. Після 5 невдалих спроб сценарій має надрукувати «Вибачте, у вас закінчилися спроби. Правильним числом було [правильний номер]» і завершити роботу.

#Згенерувати випадково число від 1 до 100 та зберегти в зміной

random_number=$(( ( RANDOM % 100 ) + 1 ))
#Відладка роботи random_number
#echo random_number is $random_number

echo "Скрипт згенерував секретне випадкове число від 1 до 100."
echo "Ви маєте 5 спроб. Спробуйте вгадати його."


input_number() {
#Пропозція до вводу числа користовучем
user_number=$1
echo "Введить число: "
read user_number

 # Перевірка чи введення є числом
    if ! [[ "$user_number" =~ ^[0-9]+$ ]]; then
        echo "Будь ласка, введіть коректне число."
        return 1
    fi

#Відладка роботи user_number
#echo "Ви отбрали число $user_number"

#Повідомлення чи число більше чи нічже випадкового числа
if [ $user_number -lt $random_number ]; then
	echo "Це спроба # $count. Число менше секретного числа."
elif [ $user_number -gt $random_number ];then
        echo "Це спроба # $count. Число більше секретного числа."	
else  
       	echo "Вітаємо - ви вгадали число"
	exit 0
fi 
}

count=1
while [ $count -le 5 ];
do
	input_number 
	count=$(( $count +1))

	if [ $count -gt 5 ]; then 
	       echo "Вибачте у вас закінчились спроби. Вірним числом було $random_number"
	fi
done


